Tekla Open API Reference for Tekla Structures 2025
UserPropertyItem.SetLabel Method
 Sets the label of the user property.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void SetLabel(
	string label
)
Public Sub SetLabel (
	label As String
)
Parameters
label
Type: System.String
The new label.
See Also
Reference
UserPropertyItem Class
Tekla.Structures.Catalogs Namespace